const log = document.getElementById('log');
const log1 = document.getElementById('tab');
const editable = document.querySelector('div[contenteidtable]');
const editable2 = document.querySelector('table[contentediable]';)
editable.addEventListener('input', logInputType);
editable2.addEventListener('input', logInputType);
function logInputType(envet){
    log.textcontent = 'input type: ${event.inputType}';
}
function logInputType(event){
    log.textcontent = 'input type: ${event.inputType}';
}
var CBR = ['2000585', '조방래', '기장', '010-4569-4255', '1972년 09월 02일','울산 동구 봉수로 450 성원상떼빌 103동 206호'];
var SJH = ['9604277', '서재호', '기원', '010-5505-9369','1973년 07월 20일', '울산 동구 방어진순환도로 733 삼전아이필하모니 101동 1707호'];
var JSY = ['2001901', '장시영', '기원', '010-6527-8489', '1971년 05월 02일', '울산 동구 바드레길 110 대경넥스빌 104동 1403호'];
var CWJ = ['2101888', '최원제', '기원', '010-5544-1629', '1976년 02월 24일', '울산 북구 화산로 19 주공 휴먼시아아파트 304동 105호'];
var LSH = ['2801321', '이승한', '4급기사', '010-5588-2659', '1983년 02월 12일', '울산 동구 안산로 50 현대동부아파트 111동 202호'];
var JKS = ['2801608', '정경수', '4급기사', '010-2869-3557', '1981년 12월 02일', '울산 동구 방어동 등대4길 26 대왕암엘크루 205동 1704호'];
var LHJ = ['2801489', '이현재', '4급기사', '010-7224-2192', '1984년 11월02일', '울산 동구 화진길 100 엠코타운이스턴베이 103동 2502호'];
var KSY = ['2900384', '김수영', '5급기사', '010-9207-5428', '1982년 05월 26일', '울산 북구 산하동 강동산하5로 52 힐스테이트 106동 302호'];
var KSM = ['A500974', '김성민', '5급기사', '010-4842-6917', '1985년05월 20일', '울산 중구 함월11길 15 천운하이빌 402호'];
var SIS = ['A502795', '서인승', '6급기사', '010-6558-8903', '1996년 12월 03일', '울산 울주군 범서읍 천상길43 경동태원하이빌아파트 104동 403호'];
var JJW = ['A502841', '장재웅', '6급기사', '010-9109-4629', '1996년 03월 26일', '전남 순천시 가곡동 가곡길 30 신영아파트 102동 509호'];
var KCJ = ['A510161', '김찬중', '7급기사', '010-2166-8527', '1999년 07월 02일', '울산 동구 녹수5길 42 로얄빌라 101호'];